# Напишите программу, которая получает на вход строку и печатает ее длину.
text = input()
print(len(text))
