# Напишите программу, которая получает на вход строку и печатает ее длину.
text = input()
print(len(text))
# Верное решение #538998298
# Python 3
print(len(input()))
