# Написать программу ввода строки и формирования новой строчки вида: "Строка: <введенная строка>.
# Длина: <длина строки>". Результат сформированной строки вывести на экран.

str = input()
print('Строка:', str + '.' + ' Длина:', len(str))
