# Напишите программу, которая получает на вход число, с помощью оператора комбинированного присваивания += увеличивает его на 10 и печатает результат.
number = int(input())
a = 10
a += number
print(a)
