# Дан список чисел от 0 до 10. На вход подается целое число. Если это число есть в списке, верните True, иначе верните False.
numbers = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
n = int(input())
#if n in numbers:
    #print('True')
#else:
    #print('False')
print(n in numbers)
