# Код Морзе для представления цифр и букв использует тире и точки.

# Напишите программу для кодирования текстового сообщения в соответствии с кодом Морзе.
c = input().upper()
letters = [c for c in 'ABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789']
morse = ['.-', '-...', '-.-.', '-..', '.', '..-.', '--.', '....', '..', '.---', '-.-', '.-..', '--', '-.', '---', '.--.', '--.-', '.-.', '...', '-', '..-', '...-', '.--', '-..-', '-.--', '--..', '-----', '.----', '..---', '...--', '....-', '.....', '-....', '--...', '---..', '----.']
morse_code = dict(zip(letters, morse))
for i in c:
    if i in morse_code:
        print(morse_code[i], end = ' ')
